*---------------------------------------------------------------*
* zSMSGateway - CICS System Definition
*---------------------------------------------------------------*
DELETE GROUP(ZSMSGRP) ALL

*--- MESSAGES PROGRAM DEFINITIONS ---*
DEFINE PROGRAM(MESSAGES) GROUP(ZSMSGRP) LANGUAGE(COBOL) 
       DATALOCATION(ANY) EXECKEY(USER) RESIDENT(NO)
*--- HISTORY PROGRAM DEFINITIONS ---*
DEFINE PROGRAM(HISTORY)  GROUP(ZSMSGRP) LANGUAGE(COBOL) 
       DATALOCATION(ANY) EXECKEY(USER) RESIDENT(NO)
*--- BALANCE PROGRAM DEFINITIONS ---*
DEFINE PROGRAM(BALANCE)  GROUP(ZSMSGRP) LANGUAGE(COBOL) 
       DATALOCATION(ANY) EXECKEY(USER) RESIDENT(NO)

*--- TRANSACTION DEFINITIONS ---*
DEFINE TRANSACTION(MSGS) GROUP(ZSMSGRP) PROGRAM(MESSAGES)
DEFINE TRANSACTION(HIST) GROUP(ZSMSGRP) PROGRAM(HISTORY)
DEFINE TRANSACTION(BAL) GROUP(ZSMSGRP) PROGRAM(BALANCE)

*--- URIMAP FOR /messages ---*
DEFINE URIMAP(ZSMSMSG)   GROUP(ZSMSGRP)
       USAGE(SERVER) SCHEME(HTTP) HOST(*)
       PATH(/messages) TRANSACTION(MSGS) PROGRAM(MESSAGES)

*--- URIMAP FOR /history ---*
DEFINE URIMAP(ZSMSHIST) GROUP(ZSMSGRP)
       USAGE(SERVER) SCHEME(HTTP) HOST(*)
       PATH(/history) TRANSACTION(HIST) PROGRAM(HISTORY)

*--- URIMAP FOR /balance ---*
DEFINE URIMAP(ZSMSBAL) GROUP(ZSMSGRP)
       USAGE(SERVER) SCHEME(HTTP) HOST(*)
       PATH(/balance) TRANSACTION(BAL) PROGRAM(BALANCE)

*--- NETWORK DEFINITION ---*
* Note: Common port for testing. 
* In production, this is usually defined by the CICS Admin.
DEFINE TCPIPSERVICE(ZSMSPORT) GROUP(ZSMSGRP)
       PORTNUMBER(9081) 
       PROTOCOL(HTTP)
       TRANSACTION(CWXN) 
       STATUS(OPEN)

*--- DB2 CONFIGURATION ---*
DEFINE DB2CONN(DB2CONN) GROUP(ZSMSGRP) DB2ID(DBBG)

*--- DB2ENTRY FOR PLAN : MESSAGES ---*
DEFINE DB2ENTRY(ZSMSENT) GROUP(ZSMSGRP)
       PLAN(MESSAGES) THREADLIMIT(20) AUTHID(IBMUSER)
*--- DB2ENTRY FOR PLAN : HISTORY ---*
DEFINE DB2ENTRY(ZSMSHIS) GROUP(ZSMSGRP)
       PLAN(HISTORY) THREADLIMIT(20) AUTHID(IBMUSER)
*--- DB2ENTRY FOR PLAN : BALANCE ---*
DEFINE DB2ENTRY(ZSMSBAL) GROUP(ZSMSGRP)
       PLAN(BALANCE) THREADLIMIT(20) AUTHID(IBMUSER)

*--- DB2 TRANSACTION ASSOCIATION WITH DB2ENTRY ---*
DEFINE DB2TRAN(ZSMSTRN)  GROUP(ZSMSGRP) 
       ENTRY(ZSMSENT) TRANSID(MSGS)
DEFINE DB2TRAN(ZSMSHTRN) GROUP(ZSMSGRP) 
       ENTRY(ZSMSHIS) TRANSID(HIST)
DEFINE DB2TRAN(ZSMSHBAL) GROUP(ZSMSGRP) 
       ENTRY(ZSMSBAL) TRANSID(BAL)         

*--- REMOVE GROUP FROM LIST IF ALREADY PRESENT ---*
*REMOVE LIST(LISTAGER) GROUP(ZSMSGRP)                
*--- ADD GROUP TO STARTUP LIST ---*
*ADD LIST(LISTAGER) GROUP(ZSMSGRP)
